Revit 2027 API
Document.GetSubelement Method
Overload List
Name | Description
GetSubelement(Reference) |  Gets the subelement referenced by the input reference.
GetSubelement(String) |  Gets the subelement referenced by a unique id string.
GetSubelement(ElementId, Int32) |  Gets the subelement referenced by a parent id and subelement id.
Top
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace